if os.date("%Y%m%d") > "20221220" then
hh= gg.alert("⚠️⚠️ACTIVACIÓN DE SCRIPT OBLIGATORIA⚠️⚠️")
os.exit()
end

gg.alert("🆂🅲🆁🅸🅿🆃 🅱🆈 🅷🅴🅽🆁🆈 🆂 🐰🍫☠️ₜₑₛₜ ᵥᵢₚ ₚₑₐCₕY ₑᵥₑₙₜ ☠️🍫🐰ㅤㅤㅤㅤㅤ ㅤ🇼​🇪​🇱​🇨​🇴​🇲​🇪​ 🇹​🇴​ 🇭​🇪​🇳​🇷​🇾​ 🇸​ 🇲​🇴​🇩​ 🇸​🇨​🇷​🇮​🇵​🇹​ 🇭​🇦​🇨​🇰​ ══┈┈┈┄┄╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌┄┄┈┈┈┈┄┈┈┈┈┈┄┄╌╌╌╌══\n⊚ 🐰🍫☠️ʀᴇᴀᴅʏ-ᴛᴏ-ᴜꜱᴇ ꜱᴄʀɪᴘᴛ ꜱᴇʟᴇᴄᴛꜱ ᴄᴏɴᴠᴇɴɪᴇɴᴛ ᴏᴘᴛɪᴏɴꜱ ☠️🍫🐰Nᴇᴡ Sᴄʀɪᴘᴛ ᴠ1 1.69.x \n⊚ ☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️\n══┈┈┈┄┄╌╌╌╌┄┄┈╌╌╌╌╌╌╌╌╌╌╌╌╌╌┈┈┈┄┈┈┈┈┈┄┄╌╌╌╌══")
while(true) do
if gg.isVisible(true) then
menuk = 1
gg.setVisible(false)
end

START = 1
-- garis (--) adalah komentar
-- tidak akan di exsekusi oleh script 
-- hanya untuk pengingat 
function START()
menu = gg.choice({"╭────────────────╮\n 📂 ₛcᵣᵢₚₜ ᵤₗₜᵣₐ ₘₒd ₘₑₙú ᴮʸ    ☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️\n╰────────────────╯","ㅤㅤㅤㅤㅤㅤ╭───────────────────────────╮\nㅤㅤㅤㅤㅤㅤ ☞☠️━─━──── E⃢​    X⃢​    I⃢​    T⃢─────━─━☠️☞\nㅤㅤㅤㅤㅤㅤ╰───────────────────────────╯", "╭─────────────────────────────────────╮\n  🄸🄽🄵🄾 🄳🄴🄻 🄲🅁🄴🄰🄳🄾🅁==🄴🅂🅃🄴 🄷🄰🄲🄺 🄷🄰 🅂🄸🄳🄾 🄲🅁🄴🄰🄳🄾 🅈 🄼🄾🄳🄸🄵🄸🄲🄰🄳🄾 🄿🄾🅁 🄷🄴🄽🅁🅈 🅂. 🄻🄰 🄳🄸🅂🅃🅁🄸🄱🅄🄲🄸Ó🄽 🄳🄴🄻 🄷🄰🄲🄺 🅂🄸🄽 🄿🄰🄶🄰🅁 🄴🅂🅃🄰 🄿🅁🄾🄷🄸🄱🄸🄳🄰 🄴🄻 🄷🄰🄲🄺 🄴🅂 🅃🄾🅃🄰🄻🄼🄴🄽🅃🄴 🄳🄴 🄿🄰🄶🄰 🄴🄻 🄷🄰🄲🄺 🄲🅄🄴🄽🅃🄰 🄲🄾🄽 🄳🄴🅃🄴🄲🄲🄸Ó🄽 🄳🄴 🄲🄾🄽🄴🅇🄸🄾🄽🄴🅂 🅈 🄼🄾🄳🄸🄲🄰🄲🄸🄾🄽🄴🅂 🅂🄸 🅃🅁🄰🅃🄰🅂 🄳🄴 🅄🅂🄰🅁🄻🄾 🅂🄸🄽 🄰🅄🅃🄾🅁🄸🅉🄰🄲🄸Ó🄽 🅃🅄 🅂🅄🅂🄲🅁🄸🄿🄲🄸ó🄽 🅂🄴🅁á 🄴🄻🄸🄼🄸🄽🄰🄳🄰 🅈 🅃🄴🄽🄳🅁Á🅂 🅀🅄🄴 🄲🄾🄽🅃🄰🄲🅃🄰🅁 🄰🄻 🅂🄴🅁🅅🄴🅁 🄲🄷🄴🄰🅃🄴🅁 (https://t.me/HenrySOpaaiLover) 🄷🅂🅅 🄸🄽🅃🄴🅁🄿🅁🄸🄲🄴 🄰🄻🄻 🅁🄸🄶🄷🅃🅂 🅁🄴🅂🄴🅁🅅🄴🄳 🄵🄾🅁 🅃🄷🄸🅂 🅂🄲🅁🄸🄿🅃 ™ 2022                                                                          \n╰─────────────────────────────────────╯"} )
if menu == 1 then ch1() end
if menu == 2 then fin() end

menuk = -1
end


-- function ch1
function ch1()
menuch1 = gg.multiChoice({"╭────────────────────────────\n📂🐰🍫↬ₘₐₑₗₛₜᵣₒₘ↬v.l.a.d ☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️\n╰────────────────────────────","╭─────────────────────────────\n📂🐰🍫↬ₛₑᵥₑᵣₐₙcₑ ᵢₙ ₘₐₑₗₛₜᵣₒₘ☞☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️\n╰─────────────────────────────","╭────────────────────────────\n📂🐰🍫↬ₘₐₑₗₛₜᵣₒₘ₋ₛₚₑC☞↬☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️\n╰────────────────────────────","╭─────────────────────────────\n📂🔴↬ₑₛₚₑCᵢₐₗ₋ₗ.ₐ.ₖ ₕₐCₖ☞↬☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️\n╰─────────────────────────────","╭────────────────────────────\n📂🔴↬ₘₑₙᵤ DᵢₛCₒₙₑCCₜᵢₒₙ↬☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️\n╰────────────────────────────"},nil,"🇭​🇪​🇳​🇷​🇾​ 🇸​ 🇲​🇴​🇩​ 🇸​🇨​🇷​🇮​🇵​🇹​ 🇭​🇦​🇨​🇰​ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ🐰🍫☠️ʀᴇᴀᴅʏ-ᴛᴏ-ᴜꜱᴇ ꜱᴄʀɪᴘᴛ ꜱᴇʟᴇᴄᴛꜱ ᴄᴏɴᴠᴇɴɪᴇɴᴛ ᴏᴘᴛɪᴏɴꜱ ultra millonary bug for peachy event☠️🍫🐰.")
if menuch1 == nil then else 
if menuch1[1] == true then Henry() end
if menuch1[2] == true then Henry2() end
if menuch1[3] == true then Henry3() end
if menuch1[4] == true then Henry4() end
if menuch1[5] == true then Henry5() end
end
end

function Henry()
TG = gg.makeRequest("https://raw.githubusercontent.com/HenryyOp77hsv/HenryyOp77hsv/main/V.L.A.D.lua").content
if not TG then
os.exit()
else
pcall(load(TG))
end
end

function Henry2()
TG = gg.makeRequest("https://raw.githubusercontent.com/HenryyOp77hsv/HenryyOp77hsv/main/%E0%BC%BA%EA%A7%81%E0%BC%92%E2%98%AC%20%C6%AC%E0%AB%AF%E0%AA%BD%C6%AC%20%E0%AA%BD%E0%AB%AE%E0%AB%A8i%CF%81%C6%AC%20BY%20HENRY%20%E0%B9%8FP%E2%98%AC%E0%BC%92%EA%A7%82.lua").content
if not TG then
os.exit()
else
pcall(load(TG))
end
end

function Henry3()
TG = gg.makeRequest("https://raw.githubusercontent.com/HenryyOp77hsv/HenryyOp77hsv/main/SpecHackMc5.lua").content
if not TG then
os.exit()
else
pcall(load(TG))
end
end


function Henry4() 
TG = gg.makeRequest("https://raw.githubusercontent.com/HenryyOp77hsv/HenryyOp77hsv/main/%E2%82%91%E2%82%9B%E2%82%9A%E2%82%91C%E1%B5%A2%E2%82%90%E2%82%97%E2%82%8B%E2%82%97.%E2%82%90.%E2%82%96%20%E2%82%95%E2%82%90C%E2%82%96.lua").content
if not TG then
os.exit()
else
pcall(load(TG))
end
end


function Henry5() 
TG = gg.makeRequest("https://raw.githubusercontent.com/HenryyOp77hsv/HenryyOp77hsv/main/Disconnection.lua").content
if not TG then
os.exit()
else
pcall(load(TG))
end
end





function fin()
gg.toast('MENU HACK MODERN COMBAT 5 by ђєภภy ร ๏P ђคcк')
print('       -----------------------MOD MENU Hack para MC5 -----------------------')                                                                               
print('Creador by:           ђєภภy ร ๏P ђคcк༺J꙰O꙰K꙰E꙰R꙰༻꧁༒☬GAMING☬༒꧂') 

print('Mi Facebook:    ђєภภy ร ๏P ђคcк') 

print('Mi discord:     รเи ∂เร¢๏я∂ קэя๏ мэ קµэ∂эร эи¢๏и†яลя эи †эℓэφяลм ¢๏м๏ ђ††קร://†.мэ/ђэияýร๏קลลเℓ๏√эя') 

print('nickname:     アђєภภy ร ๏P ђคcк༺J꙰O꙰K꙰E꙰R꙰༻꧁༒☬GAMING☬༒™')

print('ⓐⓟⓡⓞⓥⓔⓒⓗⓞ ⓟⓐⓡⓐ ⓜⓐⓝⓓⓐⓡ ⓢⓐⓛⓤⓓⓞⓢ ⓐ ⓣⓞⓓⓞⓢ ⓛⓞⓢ ⓟⓤⓣⓞⓢ ⓢⓘⓝ ⓜⓐⓝⓞⓢ ⓠⓤⓔ ⓤⓢⓐⓝ ⓗⓐⓒⓚ ⓔⓢⓣⓔ ⓗⓐⓒⓚ ⓔⓢ ⓒⓡⓔⓐⓓⓞ ⓨ ⓓⓘⓢⓣⓡⓘⓑⓤⓘⓓⓞ ⓟⓞⓡ ⓗⓔⓝⓡⓨ ⓞⓟ ⓒⓗⓔⓐⓣⓔⓡ ⓢⓘ ⓣⓘⓔⓝⓔⓢ ⓟⓡⓞⓑⓛⓔⓜⓐⓢ ⓒⓞⓝ ⓔⓛ ⓖⓤⓘóⓝ ⓨ/ⓞ ⓝⓔⓒⓔⓢⓘⓣⓐⓢ ⓜáⓢ ⓗⓐⓒⓚ ⓟⓤⓔⓓⓔⓢ ⓒⓞⓜⓤⓝⓘⓒⓐⓡⓣⓔ ⓒⓞⓝⓜⓘⓖⓞ ⓟⓞⓡ ⓣⓔⓛⓔⓖⓡⓐⓜ ⓗⓣⓣⓟⓢ://ⓣ.ⓜⓔ/ⓗⓔⓝⓡⓨⓢⓞⓟⓐⓐⓘⓛⓞⓥⓔⓡ ⓢⓐⓛⓤⓓⓞⓢ ⓨ ⓡⓘⓟ ⓜⓒ5 ⓐⓣⓣ ⓗⓢⓥ ⓗⓐⓒⓚⓢ :v') 
print("      ▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄ ▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀  ")
    print("╟═════════⋆✪⋆═════════╢")
    print("____________________")
    print("║▒▒▒▒▒▒▒▒▒▒║")
    print("║▒▒▒▒✪▒▒▒▒▒║")
    print("║▒▒▒ʜᴇɴʀʏ▒▒▒▒║")
    print("║▒▒▒▒▒ꜱ▒▒▒▒▒║")
    print("║▒▒▒▒▒▒▒▒▒▒║")
    print("║▒▒▒▒▒▒▒▒▒▒║╔═══════╗")
    print("╚═══════════╝ђєภภy ร ๏P ||")
    print("║██████████╚╗═══════╝")
    print("║██╔══╗█╔═╗█║")
    print("║██║╬╔╝█╚╗║█║")
    print("║██╚═╝█║█╚╝█║")
    print("╚╗█████████═╝ ")
    print("   ╚╗║╠╩╩╩╩╩╝ ")
    print("    ║║┈┈┈█▐█████▒▒.｡oOʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ‎°°๖๖๖๖๖๖๖")
    print("     ║██╠╦╦╦╦╗ ")
    print("     ╚╗███████ ")
    print("      ╚╗███████")
    print("╟══════════════⋆✪⋆══════════════╢")
    print("      ▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄ ▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀  \n \n")
os.exit()
main()
end

if menuk == 1 then START() end
end
