if os.date("%Y%m%d") > "20221220" then
hh= gg.alert("⚠️⚠️ACTIVACIÓN DE SCRIPT OBLIGATORIA⚠️⚠️")
os.exit()
end

gg.alert("🆂🅲🆁🅸🅿🆃 🅱🆈 🅷🅴🅽🆁🆈 🆂 🐰🍫☠️ₜₑₛₜ ᵥᵢₚ ₚₑₐCₕY ₑᵥₑₙₜ ☠️🍫🐰ㅤㅤㅤㅤㅤ ㅤ🇼​🇪​🇱​🇨​🇴​🇲​🇪​ 🇹​🇴​ 🇭​🇪​🇳​🇷​🇾​ 🇸​ 🇲​🇴​🇩​ 🇸​🇨​🇷​🇮​🇵​🇹​ 🇭​🇦​🇨​🇰​ ══┈┈┈┄┄╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌┄┄┈┈┈┈┄┈┈┈┈┈┄┄╌╌╌╌══\n⊚ 🐰🍫☠️ʀᴇᴀᴅʏ-ᴛᴏ-ᴜꜱᴇ ꜱᴄʀɪᴘᴛ ꜱᴇʟᴇᴄᴛꜱ ᴄᴏɴᴠᴇɴɪᴇɴᴛ ᴏᴘᴛɪᴏɴꜱ ☠️🍫🐰Nᴇᴡ Sᴄʀɪᴘᴛ ᴠ1 1.69.x \n⊚ ☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️\n══┈┈┈┄┄╌╌╌╌┄┄┈╌╌╌╌╌╌╌╌╌╌╌╌╌╌┈┈┈┄┈┈┈┈┈┄┄╌╌╌╌══")
gg.toast("ꈜꏳꌅ꒐ꉣꋖ ꏳꌅꁲꑒꐔ ꋖꌈꃔ꒐ꈜ꒐ꁲꃔꁲ ꅐꑀ꒒ꏳꊿꂵ ꋖꊿ ꃳꑀꐔ ꂵꐔ ꁝꁲꏳꈵ ꃳꐔ ꌅꑀꏳꊿꃔ")
gg.toast ("WAITE TO CONECTED ᔕHenry S Op,")
---LOADING STEP-[2] (💥Henry S Pro op hack💥)---



while(true) do
if gg.isVisible(true) then
menuk = 1
gg.setVisible(false)
end

START = 1
-- garis (--) adalah komentar
-- tidak akan di exsekusi oleh script 
-- hanya untuk pengingat 
function START()
menu = gg.choice({"╭────────────────╮\n📂ₛcᵣᵢₚₜ ᵤₗₜᵣₐ ₘₒd ₘₑₙú ᴮʸ    ☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️\n╰────────────────╯","╭───────────────────────────╮\n ☞☠️━─━──── E⃢​    X⃢​    I⃢​    T⃢─────━─━☠️☞\n╰───────────────────────────╯","╭─────────────────────────────────────╮\n       🄸🄽🄵🄾 🄳🄴🄻 🄲🅁🄴🄰🄳🄾🅁==🄴🅂🅃🄴 🄷🄰🄲🄺 🄷🄰 🅂🄸🄳🄾 🄲🅁🄴🄰🄳🄾 🅈 🄼🄾🄳🄸🄵🄸🄲🄰🄳🄾 🄿🄾🅁 🄷🄴🄽🅁🅈 🅂. 🄻🄰 🄳🄸🅂🅃🅁🄸🄱🅄🄲🄸Ó🄽 🄳🄴🄻 🄷🄰🄲🄺 🅂🄸🄽 🄿🄰🄶🄰🅁 🄴🅂🅃🄰 🄿🅁🄾🄷🄸🄱🄸🄳🄰 🄴🄻 🄷🄰🄲🄺 🄴🅂 🅃🄾🅃🄰🄻🄼🄴🄽🅃🄴 🄳🄴 🄿🄰🄶🄰 🄴🄻 🄷🄰🄲🄺 🄲🅄🄴🄽🅃🄰 🄲🄾🄽 🄳🄴🅃🄴🄲🄲🄸Ó🄽 🄳🄴 🄲🄾🄽🄴🅇🄸🄾🄽🄴🅂 🅈 🄼🄾🄳🄸🄲🄰🄲🄸🄾🄽🄴🅂 🅂🄸 🅃🅁🄰🅃🄰🅂 🄳🄴 🅄🅂🄰🅁🄻🄾 🅂🄸🄽 🄰🅄🅃🄾🅁🄸🅉🄰🄲🄸Ó🄽 🅃🅄 🅂🅄🅂🄲🅁🄸🄿🄲🄸ó🄽 🅂🄴🅁á 🄴🄻🄸🄼🄸🄽🄰🄳🄰 🅈 🅃🄴🄽🄳🅁Á🅂 🅀🅄🄴 🄲🄾🄽🅃🄰🄲🅃🄰🅁 🄰🄻 🅂🄴🅁🅅🄴🅁 🄲🄷🄴🄰🅃🄴🅁 (🄷🅃🅃🄿🅂://🅃.🄼🄴/🄷🄴🄽🅁🅈🅂🄾🄿🄰🄰🄸🄻🄾🅅🄴🅁) 🄷🅂🅅 🄸🄽🅃🄴🅁🄿🅁🄸🄲🄴 🄰🄻🄻 🅁🄸🄶🄷🅃🅂 🅁🄴🅂🄴🅁🅅🄴🄳 🄵🄾🅁 🅃🄷🄸🅂 🅂🄲🅁🄸🄿🅃 ™ 2022                                                                          \n╰─────────────────────────────────────╯"} )
if menu == 1 then ch1() end
if menu == 2 then fin() end

menuk = -1
end



-- function ch1
function ch1()
menuch1 = gg.multiChoice({"╭───────────────────────────────────|\n📂ₘₐₑₗₛₜᵣₒₘ₋ₛₚₑC ₛᵤₚₑᵣ ₒₚ+(ᴸᵒᵇᵇʸ)☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️ㅤㅤㅤㅤ\n╰───────────────────────────────────|","╭───────────────────────────────────|\n📂🅰🅸🅼🅱🅾🆃 🅾🅽(ᴵⁿᵍᵃᵐᵉ)☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️ㅤㅤㅤㅤ\n╰───────────────────────────────────|","╭───────────────────────────────────|\n📂🥶ₛₚₑC₋₃₈ₐ 🥶ᵢₙ ₘₐₑₗₛₜᵣₒₘ🔫(ᴵⁿᵍᵃᵐᵉ)☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️ㅤㅤㅤㅤ\n╰───────────────────────────────────|","╭───────────────────────────────────|\n📂🥶ₐₗₗ ᵢₙ ₁ FᵤₙCₜᵢₒₙ FᵣₑₑZₑ ₚᵢₛₜₒₗ🔫(ᴸᵒᵇᵇʸ)☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️ㅤㅤㅤㅤ\n╰───────────────────────────────────|","╭───────────────────────────────────|\n📂🥶FᵣₑₑZₑ ₚᵢₛₜₒₗ ᵢₙ ₘₛG₃₃🔫(ᴵⁿᵍᵃᵐᵉ)☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️ㅤㅤㅤㅤ\n╰───────────────────────────────────|","╭───────────────────────────────────|\n📂ˢᴵˣᵀᴴ ˢᴱᴺˢᴱ ᶜᴼᴿᴱ ᴴᴬᶜᴷ(ᴸᵒᵇᵇʸ)☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️ㅤㅤㅤㅤ\n╰───────────────────────────────────|"},nil,"🇭​🇪​🇳​🇷​🇾​ 🇸​ 🇲​🇴​🇩​ 🇸​🇨​🇷​🇮​🇵​🇹​ 🇭​🇦​🇨​🇰​ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ🐰🍫☠️ʀᴇᴀᴅʏ-ᴛᴏ-ᴜꜱᴇ ꜱᴄʀɪᴘᴛ ꜱᴇʟᴇᴄᴛꜱ ᴄᴏɴᴠᴇɴɪᴇɴᴛ ᴏᴘᴛɪᴏɴꜱ ultra millonary bug for peachy event☠️🍫🐰.")
if menuch1 == nil then else 
if menuch1[1] == true then ant() end
if menuch1[2] == true then ant2() end
if menuch1[3] == true then ant3() end
if menuch1[4] == true then ant4() end
if menuch1[5] == true then ant5() end
if menuch1[6] == true then ant6() end

end
end

function ant()
gg.searchNumber('"59.0F;2114.0F;0.0F:159"', gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1)
gg.refineNumber('"59"', gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1)

revert = gg.getListItems()
local t = gg.getListItems()
for i, v in ipairs(t) do
	if v.flags == gg.TYPE_FLOAT then
		v.value = '"-159"'
		v.freeze = false
		v.freezeType = gg.FREEZE_NORMAL
	end
end
gg.addListItems(t)
t = nil


gg.setRanges(gg.REGION_C_ALLOC)
gg.searchNumber('"51.0F;233377.0F;233568.0F:41"', gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1)
gg.refineNumber('"51"', gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1)
revert = gg.getResults(1, nil, nil, nil, nil, nil, nil, nil, nil)
gg.editAll('"1.0e10"', gg.TYPE_FLOAT)

revert = gg.getResults(1, nil, nil, nil, nil, nil, nil, nil, nil)
local t = gg.getResults(1, nil, nil, nil, nil, nil, nil, nil, nil)
for i, v in ipairs(t) do
	if v.flags == gg.TYPE_FLOAT then
		v.value = '"1.0e10"'
		v.freeze = true
	end
end
gg.addListItems(t)
t = nil
gg.clearResults()

gg.setRanges(gg.REGION_C_ALLOC)
gg.searchNumber('121.0F;34.79999923706F;64.0F', gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1)
gg.refineNumber('34.79999923706', gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1)
local freeze=gg.getResults(100)
for i, v in ipairs(freeze) do
if v.flags==gg.TYPE_FLOAT then
v.value='9999999999'
v.freeze=true
end
end
gg.addListItems(freeze)
gg.clearResults()

gg.setRanges(gg.REGION_C_ALLOC)
gg.searchNumber("59.0;154.0;124.0;39.0;36.0;37.5;64.0;35.0;54.0;35.0;64.0;34.0;49.0;66.0;42.0;60.0:93", gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1, 0)
gg.processResume()
gg.refineNumber("59.0", gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1, 0)
revert = gg.getResults(1000, nil, nil, nil, nil, nil, nil, nil, nil)
local t = gg.getResults(1000, nil, nil, nil, nil, nil, nil, nil, nil)
for i, v in ipairs(t) do
if v.flags == gg.TYPE_FLOAT then
v.value = "-181"
v.freeze = true
end
end
gg.addListItems(t)
t = nil
gg.clearResults()

gg.setRanges(gg.REGION_CODE_APP)
gg.searchNumber("-0.0001", gg.TYPE_FLOAT)
gg.getResults(10)
gg.editAll("999999999999999", gg.TYPE_FLOAT)
gg.clearResults()
gg.clearResults()

gg.toast('ʍα૯ℓઽƬ૨ѳʍ-ઽρ૯૮ 38 ઽષρ૯૨ ѳρ+ઽρ૯૯đ+đαʍαG૯+αIʍвѳƬ+ทѳ ૨૯૮ѳIℓ')
end



function ant2()
gg.setRanges(gg.REGION_C_ALLOC)
gg.searchNumber("0.005;0.180", gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1, 0)
revert = gg.getResults(1000, nil, nil, nil, nil, nil, nil, nil, nil)
gg.editAll("9999.8", gg.TYPE_FLOAT)
if revert ~= nil then gg.setValues(revert) end
revert = gg.getResults(1000, nil, nil, nil, nil, nil, nil, nil, nil)
gg.editAll("9999.8", gg.TYPE_FLOAT)
gg.clearResults()
gg.toast("🅰🅸🅼🅱🅾🆃")

gg.setRanges(gg.REGION_CODE_APP)
gg.searchNumber("-0.0001", gg.TYPE_FLOAT)
gg.getResults(10)
gg.editAll("9999.8", gg.TYPE_FLOAT)
gg.clearResults()
gg.toast("🅰🅸🅼🅱🅾🆃")
end



function ant3() 
gg.setRanges(gg.REGION_C_ALLOC)
gg.searchNumber("260845;66;-1596977136:9", gg.TYPE_DWORD)
gg.refineNumber("-1596977136", gg.TYPE_DWORD)
revert = gg.getResults(1)
local t = gg.getResults(1)
for i, v in ipairs(t) do
if v.flags == gg.TYPE_DWORD then
v.value = "-821,817,312"
v.freeze = true
end
end
gg.addListItems(t)
t = nil
gg.clearResults()
gg.toast("🥶SPEC38A ICED🥶 CODE FREEZE 🥶")
end

function ant4() 
gg.clearResults()
gg.searchNumber("10034.0;130.0;34.34999847412:512", gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1, 0)
gg.refineNumber("34.34999847412", gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1, 0)
revert = gg.getResults(5000, nil, nil, nil, nil, nil, nil, nil, nil)
gg.editAll("35.4", gg.TYPE_FLOAT)

revert = gg.getResults(5000, nil, nil, nil, nil, nil, nil, nil, nil)
local t = gg.getResults(5000, nil, nil, nil, nil, nil, nil, nil, nil)
for i, v in ipairs(t) do
	if v.flags == gg.TYPE_FLOAT then
		v.value = "35.4"
		v.freeze = true
	end
end
gg.addListItems(t)
t = nil
gg.clearResults()


gg.setRanges(gg.REGION_C_ALLOC)
gg.searchNumber("59.0;134.0;1033.0:73", gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1, 0)
gg.refineNumber("59", gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1, 0)

revert = gg.getResults(100, nil, nil, nil, nil, nil, nil, nil, nil)
local t = gg.getResults(100, nil, nil, nil, nil, nil, nil, nil, nil)
for i, v in ipairs(t) do
if v.flags == gg.TYPE_FLOAT then
v.value = "-177"
v.freeze = true
end
end
gg.addListItems(t)
t = nil
gg.clearResults()
gg.toast('🥶FREEZER = ON🥶')
end


function ant5() 
gg.setRanges(gg.REGION_C_ALLOC)
gg.searchNumber("-2.64835626e-23;-1.0;40.0:65", gg.TYPE_FLOAT)
gg.refineNumber("-2.64835626e-23", gg.TYPE_FLOAT)
revert = gg.getResults(1)
local t = gg.getResults(1)
for i, v in ipairs(t) do
if v.flags == gg.TYPE_FLOAT then
v.value = "-5.39260972e-33"
v.freeze = true
end
end
gg.addListItems(t)
t = nil
gg.clearResults()
gg.toast('🥶FREEZER = ON🥶 OPTION ACTIVATION IN GAME')
end

function ant6() 
gg.setRanges(gg.REGION_C_ALLOC)
gg.searchNumber('41;37;38;40;43;74;72:581', gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1)
gg.refineNumber('41', gg.TYPE_FLOAT, false, gg.SIGN_EQUAL, 0, -1)
local freeze=gg.getResults(100)
for i, v in ipairs(freeze) do
if v.flags==gg.TYPE_FLOAT then
v.value='1000'
v.freeze=true
end
end
gg.addListItems(freeze)
gg.clearResults()
gg.toast('𝐔𝐋𝐓𝐑𝐀 𝐒𝐈𝐗𝐓𝐇 𝐒𝐄𝐍𝐒𝐄 𝐎𝐍')
end

function fin()
gg.toast('MENU HACK MODERN COMBAT 5 by ђєภภy ร ๏P ђคcк')
print('       -----------------------MOD MENU Hack para MC5 -----------------------')                                                                               
print('Creador by:           ђєภภy ร ๏P ђคcк༺J꙰O꙰K꙰E꙰R꙰༻꧁༒☬GAMING☬༒꧂') 

print('Mi Facebook:    ђєภภy ร ๏P ђคcк') 

print('Mi discord:     รเи ∂เร¢๏я∂ קэя๏ мэ קµэ∂эร эи¢๏и†яลя эи †эℓэφяลм ¢๏м๏ ђ††קร://†.мэ/ђэияýร๏קลลเℓ๏√эя') 

print('nickname:     アђєภภy ร ๏P ђคcк༺J꙰O꙰K꙰E꙰R꙰༻꧁༒☬GAMING☬༒™')

print('ⓐⓟⓡⓞⓥⓔⓒⓗⓞ ⓟⓐⓡⓐ ⓜⓐⓝⓓⓐⓡ ⓢⓐⓛⓤⓓⓞⓢ ⓐ ⓣⓞⓓⓞⓢ ⓛⓞⓢ ⓟⓤⓣⓞⓢ ⓢⓘⓝ ⓜⓐⓝⓞⓢ ⓠⓤⓔ ⓤⓢⓐⓝ ⓗⓐⓒⓚ ⓔⓢⓣⓔ ⓗⓐⓒⓚ ⓔⓢ ⓒⓡⓔⓐⓓⓞ ⓨ ⓓⓘⓢⓣⓡⓘⓑⓤⓘⓓⓞ ⓟⓞⓡ ⓗⓔⓝⓡⓨ ⓞⓟ ⓒⓗⓔⓐⓣⓔⓡ ⓢⓘ ⓣⓘⓔⓝⓔⓢ ⓟⓡⓞⓑⓛⓔⓜⓐⓢ ⓒⓞⓝ ⓔⓛ ⓖⓤⓘóⓝ ⓨ/ⓞ ⓝⓔⓒⓔⓢⓘⓣⓐⓢ ⓜáⓢ ⓗⓐⓒⓚ ⓟⓤⓔⓓⓔⓢ ⓒⓞⓜⓤⓝⓘⓒⓐⓡⓣⓔ ⓒⓞⓝⓜⓘⓖⓞ ⓟⓞⓡ ⓣⓔⓛⓔⓖⓡⓐⓜ ⓗⓣⓣⓟⓢ://ⓣ.ⓜⓔ/ⓗⓔⓝⓡⓨⓢⓞⓟⓐⓐⓘⓛⓞⓥⓔⓡ ⓢⓐⓛⓤⓓⓞⓢ ⓨ ⓡⓘⓟ ⓜⓒ5 ⓐⓣⓣ ⓗⓢⓥ ⓗⓐⓒⓚⓢ :v') 
print("      ▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄ ▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀  ")
    print("╟═════════⋆✪⋆═════════╢")
    print("____________________")
    print("║▒▒▒▒▒▒▒▒▒▒║")
    print("║▒▒▒▒✪▒▒▒▒▒║")
    print("║▒▒▒ʜᴇɴʀʏ▒▒▒▒║")
    print("║▒▒▒▒▒ꜱ▒▒▒▒▒║")
    print("║▒▒▒▒▒▒▒▒▒▒║")
    print("║▒▒▒▒▒▒▒▒▒▒║╔═══════╗")
    print("╚═══════════╝ђєภภy ร ๏P ||")
    print("║██████████╚╗═══════╝")
    print("║██╔══╗█╔═╗█║")
    print("║██║╬╔╝█╚╗║█║")
    print("║██╚═╝█║█╚╝█║")
    print("╚╗█████████═╝ ")
    print("   ╚╗║╠╩╩╩╩╩╝ ")
    print("    ║║┈┈┈█▐█████▒▒.｡oOʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ‎°°๖๖๖๖๖๖๖")
    print("     ║██╠╦╦╦╦╗ ")
    print("     ╚╗███████ ")
    print("      ╚╗███████")
    print("╟══════════════⋆✪⋆══════════════╢")
    print("      ▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄ ▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀  \n \n")
os.exit()
main()
end

if menuk == 1 then START() end
end
